app/controllers/categories_controller.rb

  def listallfoods
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 19 Jul 2013 17:00:04 UTC +00:00], ["name", "test"], ["updated_at", Fri, 19 Jul 2013 17:00:04 UTC +00:00]]