app/controllers/foods_controller.rb

  def edit
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @food = Food.new(params[:food])
  # Attach new food record to current category
    @food.category_id= $current_category
    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("category_id", "created_at", "gi", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Fri, 19 Jul 2013 17:03:05 UTC +00:00], ["gi", "100"], ["name", "new food"], ["updated_at", Fri, 19 Jul 2013 17:03:05 UTC +00:00]]

  def update
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "1"]]