app/views/categories/show.html.erb


    <% @category.foods.order(:gi).each do |fd| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."category_id" = 1 ORDER BY gi